Revit 2026 API

# ApplicationIsStructuralAnalysisEnabled Property

---

Checks whether or not the structural analysis is enabled, and enable or disable it.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsStructuralAnalysisEnabled { get; set; }
```
```vb
Public Property IsStructuralAnalysisEnabled As Boolean
	Get
	Set
```
```cpp
public:
property bool IsStructuralAnalysisEnabled {
	bool get ();
	void set (bool value);
}
```
```fsharp
member IsStructuralAnalysisEnabled : bool with get, set
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InvalidOperationException | When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled. |

When structural analysis is disabled the structural analytical model will not be updated automatically by Revit. Enabling structural analysis will not take effect unless the structure discipline is also enabled.

#### Reference

Application Class

Autodesk.Revit.ApplicationServices Namespace